witalis3/UA3REO-DDC-Transceiver/STM32/Src/audio_processor.c
static void doCW_Decode(AUDIO_PROC_RX_NUM rx_id)
{
	//CW Decoder
	if(rx_id==AUDIO_RX1)
	{
		if (TRX.CWDecoder && (CurrentVFO()->Mode == TRX_MODE_CW_L || CurrentVFO()->Mode == TRX_MODE_CW_U))
			for (block = 0; block < (FPGA_AUDIO_BUFFER_HALF_SIZE / CWDECODER_SAMPLES); block++)
				CWDecoder_Process(FPGA_Audio_Buffer_RX1_I_tmp + (block * CWDECODER_SAMPLES));
	}
	else if(rx_id==AUDIO_RX2)
	{
		if (TRX.CWDecoder && (CurrentVFO()->Mode == TRX_MODE_CW_L || CurrentVFO()->Mode == TRX_MODE_CW_U))
			for (block = 0; block < (FPGA_AUDIO_BUFFER_HALF_SIZE / CWDECODER_SAMPLES); block++)
				CWDecoder_Process(FPGA_Audio_Buffer_RX2_I_tmp + (block * CWDECODER_SAMPLES));
	}
}

static void doRX_HILBERT(AUDIO_PROC_RX_NUM rx_id)
{
	//Hilbert fir
	if(rx_id==AUDIO_RX1)
	{
		arm_fir_f32(&FIR_RX1_Hilbert_I, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		arm_fir_f32(&FIR_RX1_Hilbert_Q, FPGA_Audio_Buffer_RX1_Q_tmp, FPGA_Audio_Buffer_RX1_Q_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
	}
	else if(rx_id==AUDIO_RX2)
	{
		arm_fir_f32(&FIR_RX2_Hilbert_I, FPGA_Audio_Buffer_RX2_I_tmp, FPGA_Audio_Buffer_RX2_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		arm_fir_f32(&FIR_RX2_Hilbert_Q, FPGA_Audio_Buffer_RX2_Q_tmp, FPGA_Audio_Buffer_RX2_Q_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
	}
}

static void doRX_LPF_IQ(AUDIO_PROC_RX_NUM rx_id)
{
	//IIR LPF
	if(rx_id==AUDIO_RX1)
	{
		if (CurrentVFO()->LPF_Filter_Width > 0)
		{
			arm_biquad_cascade_df2T_f32(&IIR_RX1_LPF_I, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
			arm_biquad_cascade_df2T_f32(&IIR_RX1_LPF_Q, FPGA_Audio_Buffer_RX1_Q_tmp, FPGA_Audio_Buffer_RX1_Q_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		}
	}
	else if(rx_id==AUDIO_RX2)
	{
		if (SecondaryVFO()->LPF_Filter_Width > 0)
		{
			arm_biquad_cascade_df2T_f32(&IIR_RX2_LPF_I, FPGA_Audio_Buffer_RX2_I_tmp, FPGA_Audio_Buffer_RX2_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
			arm_biquad_cascade_df2T_f32(&IIR_RX2_LPF_Q, FPGA_Audio_Buffer_RX2_Q_tmp, FPGA_Audio_Buffer_RX2_Q_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		}
	}
}

static void doRX_LPF_I(AUDIO_PROC_RX_NUM rx_id)
{
	//IIR LPF
	if(rx_id==AUDIO_RX1)
	{
		if (CurrentVFO()->LPF_Filter_Width > 0)
		{
			arm_biquad_cascade_df2T_f32(&IIR_RX1_LPF_I, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		}
	}
	else if(rx_id==AUDIO_RX2)
	{
		if (SecondaryVFO()->LPF_Filter_Width > 0)
		{
			arm_biquad_cascade_df2T_f32(&IIR_RX2_LPF_I, FPGA_Audio_Buffer_RX2_I_tmp, FPGA_Audio_Buffer_RX2_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		}
	}
}

/*static void doRX_HPF_IQ(AUDIO_PROC_RX_NUM rx_id)
{
	//IIR HPF
	if(rx_id==AUDIO_RX1)
	{
		if (CurrentVFO()->HPF_Filter_Width > 0)
		{
			arm_biquad_cascade_df2T_f32(&IIR_RX1_HPF_I, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
			arm_biquad_cascade_df2T_f32(&IIR_RX1_HPF_Q, FPGA_Audio_Buffer_RX1_Q_tmp, FPGA_Audio_Buffer_RX1_Q_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		}
	}
	else if(rx_id==AUDIO_RX2)
	{
		if (SecondaryVFO()->HPF_Filter_Width > 0)
		{
			arm_biquad_cascade_df2T_f32(&IIR_RX2_HPF_I, FPGA_Audio_Buffer_RX2_I_tmp, FPGA_Audio_Buffer_RX2_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
			arm_biquad_cascade_df2T_f32(&IIR_RX2_HPF_Q, FPGA_Audio_Buffer_RX2_Q_tmp, FPGA_Audio_Buffer_RX2_Q_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		}
	}
}*/

static void doRX_HPF_I(AUDIO_PROC_RX_NUM rx_id)
{
	//IIR HPF
	if(rx_id==AUDIO_RX1)
	{
		if (CurrentVFO()->HPF_Filter_Width > 0)
		{
			arm_biquad_cascade_df2T_f32(&IIR_RX1_HPF_I, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		}
	}
	else if(rx_id==AUDIO_RX2)
	{
		if (SecondaryVFO()->HPF_Filter_Width > 0)
		{
			arm_biquad_cascade_df2T_f32(&IIR_RX2_HPF_I, FPGA_Audio_Buffer_RX2_I_tmp, FPGA_Audio_Buffer_RX2_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		}
	}
}

static void doRX_NOTCH(AUDIO_PROC_RX_NUM rx_id)
{
	//NOTCH FILTER
	if(rx_id==AUDIO_RX1)
	{
		if (CurrentVFO()->ManualNotchFilter)
			arm_biquad_cascade_df2T_f32(&NOTCH_RX1_FILTER, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		else if (CurrentVFO()->AutoNotchFilter)
		{
			for (block = 0; block < (FPGA_AUDIO_BUFFER_HALF_SIZE / AUTO_NOTCH_BLOCK_SIZE); block++)
				processAutoNotchReduction(FPGA_Audio_Buffer_RX1_I_tmp + (block * AUTO_NOTCH_BLOCK_SIZE), rx_id);
		}
	}
	else if(rx_id==AUDIO_RX2)
	{
		if (SecondaryVFO()->ManualNotchFilter)
			arm_biquad_cascade_df2T_f32(&NOTCH_RX2_FILTER, FPGA_Audio_Buffer_RX2_I_tmp, FPGA_Audio_Buffer_RX2_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		else if (SecondaryVFO()->AutoNotchFilter)
		{
			for (block = 0; block < (FPGA_AUDIO_BUFFER_HALF_SIZE / AUTO_NOTCH_BLOCK_SIZE); block++)
				processAutoNotchReduction(FPGA_Audio_Buffer_RX2_I_tmp + (block * AUTO_NOTCH_BLOCK_SIZE), rx_id);
		}
	}
}

static void doRX_DNR(AUDIO_PROC_RX_NUM rx_id)
{
	//Digital Noise Reduction
	if(rx_id==AUDIO_RX1)
	{
		if (CurrentVFO()->DNR > 0)
		{
			for (block = 0; block < (FPGA_AUDIO_BUFFER_HALF_SIZE / NOISE_REDUCTION_BLOCK_SIZE); block++)
				processNoiseReduction(FPGA_Audio_Buffer_RX1_I_tmp + (block * NOISE_REDUCTION_BLOCK_SIZE), rx_id);
		}
	}
	else if(rx_id==AUDIO_RX2)
	{
		if (SecondaryVFO()->DNR > 0)
		{
			for (block = 0; block < (FPGA_AUDIO_BUFFER_HALF_SIZE / NOISE_REDUCTION_BLOCK_SIZE); block++)
				processNoiseReduction(FPGA_Audio_Buffer_RX2_I_tmp + (block * NOISE_REDUCTION_BLOCK_SIZE), rx_id);
		}
	}
}

static void doRX_AGC(AUDIO_PROC_RX_NUM rx_id)
{
	//AGC
	if(rx_id==AUDIO_RX1)
		DoAGC(FPGA_Audio_Buffer_RX1_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE, rx_id);
	else if(rx_id==AUDIO_RX2)
		DoAGC(FPGA_Audio_Buffer_RX2_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE, rx_id);
}

static void doRX_NoiseBlanker(AUDIO_PROC_RX_NUM rx_id)
{
	if(!TRX.NOISE_BLANKER) return;
	if(rx_id==AUDIO_RX1)
	{
		for (block = 0; block < (FPGA_AUDIO_BUFFER_HALF_SIZE / NB_BLOCK_SIZE); block++)
			processNoiseBlanking(FPGA_Audio_Buffer_RX1_I_tmp + (block * NB_BLOCK_SIZE), rx_id);
	}
	else if(rx_id==AUDIO_RX2)
	{
		for (block = 0; block < (FPGA_AUDIO_BUFFER_HALF_SIZE / NB_BLOCK_SIZE); block++)
			processNoiseBlanking(FPGA_Audio_Buffer_RX2_I_tmp + (block * NB_BLOCK_SIZE), rx_id);
	}
}

static void doRX_SMETER(AUDIO_PROC_RX_NUM rx_id)
{
	//Prepare data to calculate s-meter
	float32_t i = 0;
	if(rx_id==AUDIO_RX1)
		arm_power_f32(FPGA_Audio_Buffer_RX1_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE, &i);
	else if(rx_id==AUDIO_RX2)
		arm_power_f32(FPGA_Audio_Buffer_RX2_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE, &i);
	Processor_RX_Power_value = i / (float32_t)FPGA_AUDIO_BUFFER_HALF_SIZE;
}

